{"nodes":[{"op":"null","name":"data","inputs":[]},{"op":"null","name":"bn_data_gamma","attr":{"eps":"2e-05","fix_gamma":"True","momentum":"0.9"},"inputs":[]},{"op":"null","name":"bn_data_beta","attr":{"eps":"2e-05","fix_gamma":"True","momentum":"0.9"},"inputs":[]},{"op":"null","name":"bn_data_moving_mean","attr":{"eps":"2e-05","fix_gamma":"True","momentum":"0.9"},"inputs":[]},{"op":"null","name":"bn_data_moving_var","attr":{"eps":"2e-05","fix_gamma":"True","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"bn_data","attr":{"eps":"2e-05","fix_gamma":"True","momentum":"0.9"},"inputs":[[0,0,0],[1,0,0],[2,0,0],[3,0,1],[4,0,1]]},{"op":"null","name":"conv0_weight","attr":{"kernel":"(3, 3)","no_bias":"True","num_filter":"64","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"Convolution","name":"conv0","attr":{"kernel":"(3, 3)","no_bias":"True","num_filter":"64","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[[5,0,0],[6,0,0]]},{"op":"null","name":"stage1_unit1_bn1_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage1_unit1_bn1_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage1_unit1_bn1_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage1_unit1_bn1_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage1_unit1_bn1","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[7,0,0],[8,0,0],[9,0,0],[10,0,1],[11,0,1]]},{"op":"null","name":"stage1_unit1_conv1_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"64","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage1_unit1_conv1","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"64","pad":"(1, 1)","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[12,0,0],[13,0,0]]},{"op":"null","name":"stage1_unit1_bn2_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage1_unit1_bn2_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage1_unit1_bn2_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage1_unit1_bn2_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage1_unit1_bn2","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[14,0,0],[15,0,0],[16,0,0],[17,0,1],[18,0,1]]},{"op":"null","name":"stage1_unit1_conv2_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"64","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage1_unit1_conv2","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"64","pad":"(1, 1)","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[19,0,0],[20,0,0]]},{"op":"null","name":"stage1_unit1_sc_weight","attr":{"act_bit":"1","kernel":"(1, 1)","no_bias":"True","num_filter":"64","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage1_unit1_sc","attr":{"act_bit":"1","kernel":"(1, 1)","no_bias":"True","num_filter":"64","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[12,0,0],[22,0,0]]},{"op":"elemwise_add","name":"_plus0","inputs":[[21,0,0],[23,0,0]]},{"op":"null","name":"stage1_unit2_bn1_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage1_unit2_bn1_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage1_unit2_bn1_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage1_unit2_bn1_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage1_unit2_bn1","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[24,0,0],[25,0,0],[26,0,0],[27,0,1],[28,0,1]]},{"op":"null","name":"stage1_unit2_conv1_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"64","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage1_unit2_conv1","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"64","pad":"(1, 1)","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[29,0,0],[30,0,0]]},{"op":"null","name":"stage1_unit2_bn2_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage1_unit2_bn2_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage1_unit2_bn2_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage1_unit2_bn2_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage1_unit2_bn2","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[31,0,0],[32,0,0],[33,0,0],[34,0,1],[35,0,1]]},{"op":"null","name":"stage1_unit2_conv2_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"64","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage1_unit2_conv2","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"64","pad":"(1, 1)","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[36,0,0],[37,0,0]]},{"op":"elemwise_add","name":"_plus1","inputs":[[38,0,0],[24,0,0]]},{"op":"null","name":"stage2_unit1_bn1_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage2_unit1_bn1_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage2_unit1_bn1_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage2_unit1_bn1_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage2_unit1_bn1","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[39,0,0],[40,0,0],[41,0,0],[42,0,1],[43,0,1]]},{"op":"null","name":"stage2_unit1_conv1_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"128","pad":"(1, 1)","stride":"(2, 2)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage2_unit1_conv1","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"128","pad":"(1, 1)","stride":"(2, 2)","workspace":"256","binarized_weights_only":"True"},"inputs":[[44,0,0],[45,0,0]]},{"op":"null","name":"stage2_unit1_bn2_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage2_unit1_bn2_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage2_unit1_bn2_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage2_unit1_bn2_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage2_unit1_bn2","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[46,0,0],[47,0,0],[48,0,0],[49,0,1],[50,0,1]]},{"op":"null","name":"stage2_unit1_conv2_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"128","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage2_unit1_conv2","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"128","pad":"(1, 1)","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[51,0,0],[52,0,0]]},{"op":"null","name":"stage2_unit1_sc_weight","attr":{"act_bit":"1","kernel":"(1, 1)","no_bias":"True","num_filter":"128","stride":"(2, 2)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage2_unit1_sc","attr":{"act_bit":"1","kernel":"(1, 1)","no_bias":"True","num_filter":"128","stride":"(2, 2)","workspace":"256","binarized_weights_only":"True"},"inputs":[[44,0,0],[54,0,0]]},{"op":"elemwise_add","name":"_plus2","inputs":[[53,0,0],[55,0,0]]},{"op":"null","name":"stage2_unit2_bn1_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage2_unit2_bn1_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage2_unit2_bn1_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage2_unit2_bn1_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage2_unit2_bn1","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[56,0,0],[57,0,0],[58,0,0],[59,0,1],[60,0,1]]},{"op":"null","name":"stage2_unit2_conv1_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"128","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage2_unit2_conv1","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"128","pad":"(1, 1)","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[61,0,0],[62,0,0]]},{"op":"null","name":"stage2_unit2_bn2_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage2_unit2_bn2_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage2_unit2_bn2_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage2_unit2_bn2_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage2_unit2_bn2","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[63,0,0],[64,0,0],[65,0,0],[66,0,1],[67,0,1]]},{"op":"null","name":"stage2_unit2_conv2_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"128","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage2_unit2_conv2","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"128","pad":"(1, 1)","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[68,0,0],[69,0,0]]},{"op":"elemwise_add","name":"_plus3","inputs":[[70,0,0],[56,0,0]]},{"op":"null","name":"stage3_unit1_bn1_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage3_unit1_bn1_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage3_unit1_bn1_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage3_unit1_bn1_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage3_unit1_bn1","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[71,0,0],[72,0,0],[73,0,0],[74,0,1],[75,0,1]]},{"op":"null","name":"stage3_unit1_conv1_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"256","pad":"(1, 1)","stride":"(2, 2)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage3_unit1_conv1","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"256","pad":"(1, 1)","stride":"(2, 2)","workspace":"256","binarized_weights_only":"True"},"inputs":[[76,0,0],[77,0,0]]},{"op":"null","name":"stage3_unit1_bn2_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage3_unit1_bn2_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage3_unit1_bn2_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage3_unit1_bn2_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage3_unit1_bn2","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[78,0,0],[79,0,0],[80,0,0],[81,0,1],[82,0,1]]},{"op":"null","name":"stage3_unit1_conv2_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"256","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage3_unit1_conv2","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"256","pad":"(1, 1)","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[83,0,0],[84,0,0]]},{"op":"null","name":"stage3_unit1_sc_weight","attr":{"act_bit":"1","kernel":"(1, 1)","no_bias":"True","num_filter":"256","stride":"(2, 2)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage3_unit1_sc","attr":{"act_bit":"1","kernel":"(1, 1)","no_bias":"True","num_filter":"256","stride":"(2, 2)","workspace":"256","binarized_weights_only":"True"},"inputs":[[76,0,0],[86,0,0]]},{"op":"elemwise_add","name":"_plus4","inputs":[[85,0,0],[87,0,0]]},{"op":"null","name":"stage3_unit2_bn1_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage3_unit2_bn1_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage3_unit2_bn1_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage3_unit2_bn1_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage3_unit2_bn1","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[88,0,0],[89,0,0],[90,0,0],[91,0,1],[92,0,1]]},{"op":"null","name":"stage3_unit2_conv1_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"256","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage3_unit2_conv1","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"256","pad":"(1, 1)","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[93,0,0],[94,0,0]]},{"op":"null","name":"stage3_unit2_bn2_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage3_unit2_bn2_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage3_unit2_bn2_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage3_unit2_bn2_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage3_unit2_bn2","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[95,0,0],[96,0,0],[97,0,0],[98,0,1],[99,0,1]]},{"op":"null","name":"stage3_unit2_conv2_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"256","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage3_unit2_conv2","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"256","pad":"(1, 1)","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[100,0,0],[101,0,0]]},{"op":"elemwise_add","name":"_plus5","inputs":[[102,0,0],[88,0,0]]},{"op":"null","name":"stage4_unit1_bn1_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage4_unit1_bn1_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage4_unit1_bn1_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage4_unit1_bn1_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage4_unit1_bn1","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[103,0,0],[104,0,0],[105,0,0],[106,0,1],[107,0,1]]},{"op":"null","name":"stage4_unit1_conv1_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"512","pad":"(1, 1)","stride":"(2, 2)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage4_unit1_conv1","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"512","pad":"(1, 1)","stride":"(2, 2)","workspace":"256","binarized_weights_only":"True"},"inputs":[[108,0,0],[109,0,0]]},{"op":"null","name":"stage4_unit1_bn2_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage4_unit1_bn2_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage4_unit1_bn2_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage4_unit1_bn2_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage4_unit1_bn2","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[110,0,0],[111,0,0],[112,0,0],[113,0,1],[114,0,1]]},{"op":"null","name":"stage4_unit1_conv2_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"512","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage4_unit1_conv2","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"512","pad":"(1, 1)","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[115,0,0],[116,0,0]]},{"op":"null","name":"stage4_unit1_sc_weight","attr":{"act_bit":"1","kernel":"(1, 1)","no_bias":"True","num_filter":"512","stride":"(2, 2)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage4_unit1_sc","attr":{"act_bit":"1","kernel":"(1, 1)","no_bias":"True","num_filter":"512","stride":"(2, 2)","workspace":"256","binarized_weights_only":"True"},"inputs":[[108,0,0],[118,0,0]]},{"op":"elemwise_add","name":"_plus6","inputs":[[117,0,0],[119,0,0]]},{"op":"null","name":"stage4_unit2_bn1_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage4_unit2_bn1_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage4_unit2_bn1_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage4_unit2_bn1_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage4_unit2_bn1","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[120,0,0],[121,0,0],[122,0,0],[123,0,1],[124,0,1]]},{"op":"null","name":"stage4_unit2_conv1_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"512","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage4_unit2_conv1","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"512","pad":"(1, 1)","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[125,0,0],[126,0,0]]},{"op":"null","name":"stage4_unit2_bn2_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage4_unit2_bn2_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage4_unit2_bn2_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage4_unit2_bn2_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage4_unit2_bn2","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[127,0,0],[128,0,0],[129,0,0],[130,0,1],[131,0,1]]},{"op":"null","name":"stage4_unit2_conv2_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"512","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage4_unit2_conv2","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"512","pad":"(1, 1)","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[132,0,0],[133,0,0]]},{"op":"elemwise_add","name":"_plus7","inputs":[[134,0,0],[120,0,0]]},{"op":"null","name":"bn1_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"bn1_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"bn1_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"bn1_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"bn1","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[135,0,0],[136,0,0],[137,0,0],[138,0,1],[139,0,1]]},{"op":"Activation","name":"relu1","attr":{"act_type":"relu"},"inputs":[[140,0,0]]},{"op":"Pooling","name":"pool1","attr":{"global_pool":"True","kernel":"(7, 7)","pool_type":"avg"},"inputs":[[141,0,0]]},{"op":"Flatten","name":"flatten0","inputs":[[142,0,0]]},{"op":"null","name":"fc1_weight","attr":{"num_hidden":"10"},"inputs":[]},{"op":"null","name":"fc1_bias","attr":{"num_hidden":"10"},"inputs":[]},{"op":"FullyConnected","name":"fc1","attr":{"num_hidden":"10"},"inputs":[[143,0,0],[144,0,0],[145,0,0]]},{"op":"null","name":"softmax_label","inputs":[]},{"op":"SoftmaxOutput","name":"softmax","inputs":[[146,0,0],[147,0,0]]}],"arg_nodes":[0,1,2,3,4,6,8,9,10,11,13,15,16,17,18,20,22,25,26,27,28,30,32,33,34,35,37,40,41,42,43,45,47,48,49,50,52,54,57,58,59,60,62,64,65,66,67,69,72,73,74,75,77,79,80,81,82,84,86,89,90,91,92,94,96,97,98,99,101,104,105,106,107,109,111,112,113,114,116,118,121,122,123,124,126,128,129,130,131,133,136,137,138,139,144,145,147],"node_row_ptr":[0,1,2,3,4,5,8,9,10,11,12,13,14,17,18,19,20,21,22,23,26,27,28,29,30,31,32,33,34,35,38,39,40,41,42,43,44,47,48,49,50,51,52,53,54,57,58,59,60,61,62,63,66,67,68,69,70,71,72,73,74,75,78,79,80,81,82,83,84,87,88,89,90,91,92,93,94,97,98,99,100,101,102,103,106,107,108,109,110,111,112,113,114,115,118,119,120,121,122,123,124,127,128,129,130,131,132,133,134,137,138,139,140,141,142,143,146,147,148,149,150,151,152,153,154,155,158,159,160,161,162,163,164,167,168,169,170,171,172,173,174,177,178,179,180,181,182,183,184,185],"heads":[[148,0,0]],"attrs":{"mxnet_version":["int",903]}}