{"nodes":[{"op":"null","name":"data","inputs":[]},{"op":"null","name":"bn_data_gamma","attr":{"eps":"2e-05","fix_gamma":"True","momentum":"0.9"},"inputs":[]},{"op":"null","name":"bn_data_beta","attr":{"eps":"2e-05","fix_gamma":"True","momentum":"0.9"},"inputs":[]},{"op":"null","name":"bn_data_moving_mean","attr":{"eps":"2e-05","fix_gamma":"True","momentum":"0.9"},"inputs":[]},{"op":"null","name":"bn_data_moving_var","attr":{"eps":"2e-05","fix_gamma":"True","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"bn_data","attr":{"eps":"2e-05","fix_gamma":"True","momentum":"0.9"},"inputs":[[0,0,0],[1,0,0],[2,0,0],[3,0,1],[4,0,1]]},{"op":"null","name":"conv0_weight","attr":{"kernel":"(7, 7)","no_bias":"True","num_filter":"64","pad":"(3, 3)","stride":"(2, 2)","workspace":"256"},"inputs":[]},{"op":"Convolution","name":"conv0","attr":{"kernel":"(7, 7)","no_bias":"True","num_filter":"64","pad":"(3, 3)","stride":"(2, 2)","workspace":"256"},"inputs":[[5,0,0],[6,0,0]]},{"op":"null","name":"bn0_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"bn0_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"bn0_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"bn0_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"bn0","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[7,0,0],[8,0,0],[9,0,0],[10,0,1],[11,0,1]]},{"op":"Activation","name":"relu0","attr":{"act_type":"relu"},"inputs":[[12,0,0]]},{"op":"Pooling","name":"pooling0","attr":{"kernel":"(3, 3)","pad":"(1, 1)","pool_type":"max","stride":"(2, 2)"},"inputs":[[13,0,0]]},{"op":"null","name":"stage1_unit1_bn1_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage1_unit1_bn1_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage1_unit1_bn1_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage1_unit1_bn1_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage1_unit1_bn1","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[14,0,0],[15,0,0],[16,0,0],[17,0,1],[18,0,1]]},{"op":"QActivation","name":"qactivation0","attr":{"act_bit":"1","backward_only":"True"},"inputs":[[19,0,0]]},{"op":"null","name":"stage1_unit1_conv1_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"64","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage1_unit1_conv1","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"64","pad":"(1, 1)","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[20,0,0],[21,0,0]]},{"op":"null","name":"stage1_unit1_bn2_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage1_unit1_bn2_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage1_unit1_bn2_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage1_unit1_bn2_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage1_unit1_bn2","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[22,0,0],[23,0,0],[24,0,0],[25,0,1],[26,0,1]]},{"op":"QActivation","name":"qactivation1","attr":{"act_bit":"1","backward_only":"True"},"inputs":[[27,0,0]]},{"op":"null","name":"stage1_unit1_conv2_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"64","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage1_unit1_conv2","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"64","pad":"(1, 1)","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[28,0,0],[29,0,0]]},{"op":"null","name":"stage1_unit1_sc_weight","attr":{"act_bit":"1","kernel":"(1, 1)","no_bias":"True","num_filter":"64","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage1_unit1_sc","attr":{"act_bit":"1","kernel":"(1, 1)","no_bias":"True","num_filter":"64","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[20,0,0],[31,0,0]]},{"op":"elemwise_add","name":"_plus0","inputs":[[30,0,0],[32,0,0]]},{"op":"null","name":"stage1_unit2_bn1_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage1_unit2_bn1_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage1_unit2_bn1_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage1_unit2_bn1_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage1_unit2_bn1","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[33,0,0],[34,0,0],[35,0,0],[36,0,1],[37,0,1]]},{"op":"QActivation","name":"qactivation2","attr":{"act_bit":"1","backward_only":"True"},"inputs":[[38,0,0]]},{"op":"null","name":"stage1_unit2_conv1_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"64","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage1_unit2_conv1","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"64","pad":"(1, 1)","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[39,0,0],[40,0,0]]},{"op":"null","name":"stage1_unit2_bn2_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage1_unit2_bn2_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage1_unit2_bn2_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage1_unit2_bn2_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage1_unit2_bn2","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[41,0,0],[42,0,0],[43,0,0],[44,0,1],[45,0,1]]},{"op":"QActivation","name":"qactivation3","attr":{"act_bit":"1","backward_only":"True"},"inputs":[[46,0,0]]},{"op":"null","name":"stage1_unit2_conv2_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"64","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage1_unit2_conv2","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"64","pad":"(1, 1)","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[47,0,0],[48,0,0]]},{"op":"elemwise_add","name":"_plus1","inputs":[[49,0,0],[33,0,0]]},{"op":"null","name":"stage2_unit1_bn1_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage2_unit1_bn1_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage2_unit1_bn1_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage2_unit1_bn1_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage2_unit1_bn1","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[50,0,0],[51,0,0],[52,0,0],[53,0,1],[54,0,1]]},{"op":"QActivation","name":"qactivation4","attr":{"act_bit":"1","backward_only":"True"},"inputs":[[55,0,0]]},{"op":"null","name":"stage2_unit1_conv1_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"128","pad":"(1, 1)","stride":"(2, 2)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage2_unit1_conv1","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"128","pad":"(1, 1)","stride":"(2, 2)","workspace":"256","binarized_weights_only":"True"},"inputs":[[56,0,0],[57,0,0]]},{"op":"null","name":"stage2_unit1_bn2_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage2_unit1_bn2_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage2_unit1_bn2_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage2_unit1_bn2_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage2_unit1_bn2","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[58,0,0],[59,0,0],[60,0,0],[61,0,1],[62,0,1]]},{"op":"QActivation","name":"qactivation5","attr":{"act_bit":"1","backward_only":"True"},"inputs":[[63,0,0]]},{"op":"null","name":"stage2_unit1_conv2_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"128","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage2_unit1_conv2","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"128","pad":"(1, 1)","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[64,0,0],[65,0,0]]},{"op":"null","name":"stage2_unit1_sc_weight","attr":{"act_bit":"1","kernel":"(1, 1)","no_bias":"True","num_filter":"128","stride":"(2, 2)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage2_unit1_sc","attr":{"act_bit":"1","kernel":"(1, 1)","no_bias":"True","num_filter":"128","stride":"(2, 2)","workspace":"256","binarized_weights_only":"True"},"inputs":[[56,0,0],[67,0,0]]},{"op":"elemwise_add","name":"_plus2","inputs":[[66,0,0],[68,0,0]]},{"op":"null","name":"stage2_unit2_bn1_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage2_unit2_bn1_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage2_unit2_bn1_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage2_unit2_bn1_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage2_unit2_bn1","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[69,0,0],[70,0,0],[71,0,0],[72,0,1],[73,0,1]]},{"op":"QActivation","name":"qactivation6","attr":{"act_bit":"1","backward_only":"True"},"inputs":[[74,0,0]]},{"op":"null","name":"stage2_unit2_conv1_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"128","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage2_unit2_conv1","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"128","pad":"(1, 1)","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[75,0,0],[76,0,0]]},{"op":"null","name":"stage2_unit2_bn2_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage2_unit2_bn2_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage2_unit2_bn2_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage2_unit2_bn2_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage2_unit2_bn2","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[77,0,0],[78,0,0],[79,0,0],[80,0,1],[81,0,1]]},{"op":"QActivation","name":"qactivation7","attr":{"act_bit":"1","backward_only":"True"},"inputs":[[82,0,0]]},{"op":"null","name":"stage2_unit2_conv2_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"128","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage2_unit2_conv2","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"128","pad":"(1, 1)","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[83,0,0],[84,0,0]]},{"op":"elemwise_add","name":"_plus3","inputs":[[85,0,0],[69,0,0]]},{"op":"null","name":"stage3_unit1_bn1_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage3_unit1_bn1_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage3_unit1_bn1_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage3_unit1_bn1_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage3_unit1_bn1","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[86,0,0],[87,0,0],[88,0,0],[89,0,1],[90,0,1]]},{"op":"QActivation","name":"qactivation8","attr":{"act_bit":"1","backward_only":"True"},"inputs":[[91,0,0]]},{"op":"null","name":"stage3_unit1_conv1_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"256","pad":"(1, 1)","stride":"(2, 2)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage3_unit1_conv1","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"256","pad":"(1, 1)","stride":"(2, 2)","workspace":"256","binarized_weights_only":"True"},"inputs":[[92,0,0],[93,0,0]]},{"op":"null","name":"stage3_unit1_bn2_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage3_unit1_bn2_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage3_unit1_bn2_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage3_unit1_bn2_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage3_unit1_bn2","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[94,0,0],[95,0,0],[96,0,0],[97,0,1],[98,0,1]]},{"op":"QActivation","name":"qactivation9","attr":{"act_bit":"1","backward_only":"True"},"inputs":[[99,0,0]]},{"op":"null","name":"stage3_unit1_conv2_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"256","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage3_unit1_conv2","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"256","pad":"(1, 1)","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[100,0,0],[101,0,0]]},{"op":"null","name":"stage3_unit1_sc_weight","attr":{"act_bit":"1","kernel":"(1, 1)","no_bias":"True","num_filter":"256","stride":"(2, 2)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage3_unit1_sc","attr":{"act_bit":"1","kernel":"(1, 1)","no_bias":"True","num_filter":"256","stride":"(2, 2)","workspace":"256","binarized_weights_only":"True"},"inputs":[[92,0,0],[103,0,0]]},{"op":"elemwise_add","name":"_plus4","inputs":[[102,0,0],[104,0,0]]},{"op":"null","name":"stage3_unit2_bn1_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage3_unit2_bn1_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage3_unit2_bn1_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage3_unit2_bn1_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage3_unit2_bn1","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[105,0,0],[106,0,0],[107,0,0],[108,0,1],[109,0,1]]},{"op":"QActivation","name":"qactivation10","attr":{"act_bit":"1","backward_only":"True"},"inputs":[[110,0,0]]},{"op":"null","name":"stage3_unit2_conv1_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"256","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage3_unit2_conv1","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"256","pad":"(1, 1)","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[111,0,0],[112,0,0]]},{"op":"null","name":"stage3_unit2_bn2_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage3_unit2_bn2_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage3_unit2_bn2_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage3_unit2_bn2_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage3_unit2_bn2","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[113,0,0],[114,0,0],[115,0,0],[116,0,1],[117,0,1]]},{"op":"QActivation","name":"qactivation11","attr":{"act_bit":"1","backward_only":"True"},"inputs":[[118,0,0]]},{"op":"null","name":"stage3_unit2_conv2_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"256","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage3_unit2_conv2","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"256","pad":"(1, 1)","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[119,0,0],[120,0,0]]},{"op":"elemwise_add","name":"_plus5","inputs":[[121,0,0],[105,0,0]]},{"op":"null","name":"stage4_unit1_bn1_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage4_unit1_bn1_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage4_unit1_bn1_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage4_unit1_bn1_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage4_unit1_bn1","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[122,0,0],[123,0,0],[124,0,0],[125,0,1],[126,0,1]]},{"op":"QActivation","name":"qactivation12","attr":{"act_bit":"1","backward_only":"True"},"inputs":[[127,0,0]]},{"op":"null","name":"stage4_unit1_conv1_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"512","pad":"(1, 1)","stride":"(2, 2)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage4_unit1_conv1","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"512","pad":"(1, 1)","stride":"(2, 2)","workspace":"256","binarized_weights_only":"True"},"inputs":[[128,0,0],[129,0,0]]},{"op":"null","name":"stage4_unit1_bn2_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage4_unit1_bn2_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage4_unit1_bn2_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage4_unit1_bn2_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage4_unit1_bn2","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[130,0,0],[131,0,0],[132,0,0],[133,0,1],[134,0,1]]},{"op":"QActivation","name":"qactivation13","attr":{"act_bit":"1","backward_only":"True"},"inputs":[[135,0,0]]},{"op":"null","name":"stage4_unit1_conv2_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"512","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage4_unit1_conv2","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"512","pad":"(1, 1)","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[136,0,0],[137,0,0]]},{"op":"null","name":"stage4_unit1_sc_weight","attr":{"act_bit":"1","kernel":"(1, 1)","no_bias":"True","num_filter":"512","stride":"(2, 2)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage4_unit1_sc","attr":{"act_bit":"1","kernel":"(1, 1)","no_bias":"True","num_filter":"512","stride":"(2, 2)","workspace":"256","binarized_weights_only":"True"},"inputs":[[128,0,0],[139,0,0]]},{"op":"elemwise_add","name":"_plus6","inputs":[[138,0,0],[140,0,0]]},{"op":"null","name":"stage4_unit2_bn1_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage4_unit2_bn1_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage4_unit2_bn1_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage4_unit2_bn1_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage4_unit2_bn1","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[141,0,0],[142,0,0],[143,0,0],[144,0,1],[145,0,1]]},{"op":"QActivation","name":"qactivation14","attr":{"act_bit":"1","backward_only":"True"},"inputs":[[146,0,0]]},{"op":"null","name":"stage4_unit2_conv1_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"512","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage4_unit2_conv1","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"512","pad":"(1, 1)","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[147,0,0],[148,0,0]]},{"op":"null","name":"stage4_unit2_bn2_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage4_unit2_bn2_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage4_unit2_bn2_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"stage4_unit2_bn2_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"stage4_unit2_bn2","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[149,0,0],[150,0,0],[151,0,0],[152,0,1],[153,0,1]]},{"op":"QActivation","name":"qactivation15","attr":{"act_bit":"1","backward_only":"True"},"inputs":[[154,0,0]]},{"op":"null","name":"stage4_unit2_conv2_weight","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"512","pad":"(1, 1)","stride":"(1, 1)","workspace":"256"},"inputs":[]},{"op":"QConvolution","name":"stage4_unit2_conv2","attr":{"act_bit":"1","kernel":"(3, 3)","no_bias":"True","num_filter":"512","pad":"(1, 1)","stride":"(1, 1)","workspace":"256","binarized_weights_only":"True"},"inputs":[[155,0,0],[156,0,0]]},{"op":"elemwise_add","name":"_plus7","inputs":[[157,0,0],[141,0,0]]},{"op":"null","name":"bn1_gamma","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"bn1_beta","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"bn1_moving_mean","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"null","name":"bn1_moving_var","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[]},{"op":"BatchNorm","name":"bn1","attr":{"eps":"2e-05","fix_gamma":"False","momentum":"0.9"},"inputs":[[158,0,0],[159,0,0],[160,0,0],[161,0,1],[162,0,1]]},{"op":"Activation","name":"relu1","attr":{"act_type":"relu"},"inputs":[[163,0,0]]},{"op":"Pooling","name":"pool1","attr":{"global_pool":"True","kernel":"(7, 7)","pool_type":"avg"},"inputs":[[164,0,0]]},{"op":"Flatten","name":"flatten0","inputs":[[165,0,0]]},{"op":"null","name":"fc1_weight","attr":{"num_hidden":"1000"},"inputs":[]},{"op":"null","name":"fc1_bias","attr":{"num_hidden":"1000"},"inputs":[]},{"op":"FullyConnected","name":"fc1","attr":{"num_hidden":"1000"},"inputs":[[166,0,0],[167,0,0],[168,0,0]]},{"op":"null","name":"softmax_label","inputs":[]},{"op":"SoftmaxOutput","name":"softmax","inputs":[[169,0,0],[170,0,0]]}],"arg_nodes":[0,1,2,3,4,6,8,9,10,11,15,16,17,18,21,23,24,25,26,29,31,34,35,36,37,40,42,43,44,45,48,51,52,53,54,57,59,60,61,62,65,67,70,71,72,73,76,78,79,80,81,84,87,88,89,90,93,95,96,97,98,101,103,106,107,108,109,112,114,115,116,117,120,123,124,125,126,129,131,132,133,134,137,139,142,143,144,145,148,150,151,152,153,156,159,160,161,162,167,168,170],"node_row_ptr":[0,1,2,3,4,5,8,9,10,11,12,13,14,17,18,19,20,21,22,23,26,27,28,29,30,31,32,33,36,37,38,39,40,41,42,43,44,45,46,49,50,51,52,53,54,55,56,59,60,61,62,63,64,65,66,67,70,71,72,73,74,75,76,77,80,81,82,83,84,85,86,87,88,89,90,93,94,95,96,97,98,99,100,103,104,105,106,107,108,109,110,111,114,115,116,117,118,119,120,121,124,125,126,127,128,129,130,131,132,133,134,137,138,139,140,141,142,143,144,147,148,149,150,151,152,153,154,155,158,159,160,161,162,163,164,165,168,169,170,171,172,173,174,175,176,177,178,181,182,183,184,185,186,187,188,191,192,193,194,195,196,197,198,199,202,203,204,205,206,207,208,209,210],"heads":[[171,0,0]],"attrs":{"mxnet_version":["int",903]}}