{"nodes":[{"op":"null","name":"data","inputs":[]},{"op":"null","name":"convolution0_weight","attr":{"kernel":"(5, 5)","num_filter":"64"},"inputs":[]},{"op":"null","name":"convolution0_bias","attr":{"kernel":"(5, 5)","num_filter":"64"},"inputs":[]},{"op":"Convolution","name":"convolution0","attr":{"kernel":"(5, 5)","num_filter":"64"},"inputs":[[0,0,0],[1,0,0],[2,0,0]]},{"op":"null","name":"batchnorm0_gamma","inputs":[]},{"op":"null","name":"batchnorm0_beta","inputs":[]},{"op":"null","name":"batchnorm0_moving_mean","inputs":[]},{"op":"null","name":"batchnorm0_moving_var","inputs":[]},{"op":"BatchNorm","name":"batchnorm0","inputs":[[3,0,0],[4,0,0],[5,0,0],[6,0,1],[7,0,1]]},{"op":"Pooling","name":"pooling0","attr":{"kernel":"(2, 2)","pool_type":"max","stride":"(2, 2)"},"inputs":[[8,0,0]]},{"op":"QActivation","name":"qactivation0","attr":{"act_bit":"1"},"inputs":[[9,0,0]]},{"op":"null","name":"qconvolution0_weight","attr":{"act_bit":"1","kernel":"(5, 5)","num_filter":"64","scaling_factor":"False"},"inputs":[]},{"op":"QConvolution","name":"qconvolution0","attr":{"act_bit":"1","kernel":"(5, 5)","num_filter":"64","scaling_factor":"False","binarized_weights_only":"True"},"inputs":[[10,0,0],[11,0,0]]},{"op":"null","name":"batchnorm1_gamma","inputs":[]},{"op":"null","name":"batchnorm1_beta","inputs":[]},{"op":"null","name":"batchnorm1_moving_mean","inputs":[]},{"op":"null","name":"batchnorm1_moving_var","inputs":[]},{"op":"BatchNorm","name":"batchnorm1","inputs":[[12,0,0],[13,0,0],[14,0,0],[15,0,1],[16,0,1]]},{"op":"Pooling","name":"pooling1","attr":{"kernel":"(2, 2)","pool_type":"max","stride":"(2, 2)"},"inputs":[[17,0,0]]},{"op":"Flatten","name":"flatten0","inputs":[[18,0,0]]},{"op":"Activation","name":"activation0","attr":{"act_type":"tanh"},"inputs":[[19,0,0]]},{"op":"null","name":"fullyconnected0_weight","attr":{"num_hidden":"500"},"inputs":[]},{"op":"null","name":"fullyconnected0_bias","attr":{"num_hidden":"500"},"inputs":[]},{"op":"FullyConnected","name":"fullyconnected0","attr":{"num_hidden":"500"},"inputs":[[20,0,0],[21,0,0],[22,0,0]]},{"op":"null","name":"batchnorm2_gamma","inputs":[]},{"op":"null","name":"batchnorm2_beta","inputs":[]},{"op":"null","name":"batchnorm2_moving_mean","inputs":[]},{"op":"null","name":"batchnorm2_moving_var","inputs":[]},{"op":"BatchNorm","name":"batchnorm2","inputs":[[23,0,0],[24,0,0],[25,0,0],[26,0,1],[27,0,1]]},{"op":"Activation","name":"activation1","attr":{"act_type":"tanh"},"inputs":[[28,0,0]]},{"op":"null","name":"fullyconnected1_weight","attr":{"num_hidden":"10"},"inputs":[]},{"op":"null","name":"fullyconnected1_bias","attr":{"num_hidden":"10"},"inputs":[]},{"op":"FullyConnected","name":"fullyconnected1","attr":{"num_hidden":"10"},"inputs":[[29,0,0],[30,0,0],[31,0,0]]},{"op":"null","name":"softmax_label","inputs":[]},{"op":"SoftmaxOutput","name":"softmax","inputs":[[32,0,0],[33,0,0]]}],"arg_nodes":[0,1,2,4,5,6,7,11,13,14,15,16,21,22,24,25,26,27,30,31,33],"node_row_ptr":[0,1,2,3,4,5,6,7,8,11,12,13,14,15,16,17,18,19,22,23,24,25,26,27,28,29,30,31,32,35,36,37,38,39,40,41],"heads":[[34,0,0]],"attrs":{"mxnet_version":["int",903]}}